MaJerle/stm32-usart-uart-dma-rx-tx/drivers/CMSIS/Device/ST/STM32C5xx/SVD/STM32C591.svd
        <register>
          <name>USBSRAM_CHEP_RXTXBD_4</name>
          <displayName>USBSRAM_CHEP_RXTXBD_4</displayName>
          <description>Channel/endpoint receive buffer descriptor 4</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_4_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_4_ALTERNATE1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 4</description>
          <alternateRegister>USBSRAM_CHEP_RXTXBD_4</alternateRegister>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_5</name>
          <displayName>USBSRAM_CHEP_TXRXBD_5</displayName>
          <description>Channel/endpoint transmit buffer descriptor 5</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_5_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_5_ALTERNATE1</displayName>
          <description>Channel/endpoint receive buffer descriptor 5</description>
          <alternateRegister>USBSRAM_CHEP_TXRXBD_5</alternateRegister>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_5</name>
          <displayName>USBSRAM_CHEP_RXTXBD_5</displayName>
          <description>Channel/endpoint receive buffer descriptor 5</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_5_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_5_ALTERNATE1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 5</description>
          <alternateRegister>USBSRAM_CHEP_RXTXBD_5</alternateRegister>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_6</name>
          <displayName>USBSRAM_CHEP_TXRXBD_6</displayName>
          <description>Channel/endpoint transmit buffer descriptor 6</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_6_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_6_ALTERNATE1</displayName>
          <description>Channel/endpoint receive buffer descriptor 6</description>
          <alternateRegister>USBSRAM_CHEP_TXRXBD_6</alternateRegister>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_6</name>
          <displayName>USBSRAM_CHEP_RXTXBD_6</displayName>
          <description>Channel/endpoint receive buffer descriptor 6</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_6_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_6_ALTERNATE1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 6</description>
          <alternateRegister>USBSRAM_CHEP_RXTXBD_6</alternateRegister>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_7</name>
          <displayName>USBSRAM_CHEP_TXRXBD_7</displayName>
          <description>Channel/endpoint transmit buffer descriptor 7</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_TXRXBD_7_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_TXRXBD_7_ALTERNATE1</displayName>
          <description>Channel/endpoint receive buffer descriptor 7</description>
          <alternateRegister>USBSRAM_CHEP_TXRXBD_7</alternateRegister>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_7</name>
          <displayName>USBSRAM_CHEP_RXTXBD_7</displayName>
          <description>Channel/endpoint receive buffer descriptor 7</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_RX</name>
              <description>Reception buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_RX</name>
              <description>Reception byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NUM_BLOCK</name>
              <description>Number of blocks</description>
              <bitOffset>26</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BLSIZE</name>
              <description>Block size</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>USBSRAM_CHEP_RXTXBD_7_ALTERNATE1</name>
          <displayName>USBSRAM_CHEP_RXTXBD_7_ALTERNATE1</displayName>
          <description>Channel/endpoint transmit buffer descriptor 7</description>
          <alternateRegister>USBSRAM_CHEP_RXTXBD_7</alternateRegister>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>ADDR_TX</name>
              <description>Transmission buffer address</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COUNT_TX</name>
              <description>Transmission byte count</description>
              <bitOffset>16</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
